Mascotte2/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 3970000;

boundaryField
{
    inlet
    {
        type            fixedFluxPressure;
        value           uniorm 0;
    }

    outlet
    {
        type            fixedValue;
        value           uniform 3970000;
    }

    bottom1
    {
        type           fixedFluxPressure;
        value          uniform 0;
    }

    bottom2
    {
        type           fixedFluxPressure;
        value          uniform 0;
    }

    top1
    {
        type           fixedFluxPressure;
        value          uniform 0;
    }

    top2
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
}

// ************************************************************************* //
